<h1>Exploring and Cleaning EBAY Car Sales Data </h1>
<p> The aim of this project is to use Python 3's Pandas library to clean EBAY car sales data.  The dataset is originally found here: https://www.kaggle.com/orgesleka/used-cars-database/data</p>

In [94]:
import pandas as pd
import numpy as np

autos= pd.read_csv("autos.csv", encoding= "Latin-1")

In [95]:
autos.info()
autos.head()
autos.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 20 columns):
dateCrawled            50000 non-null object
name                   50000 non-null object
seller                 50000 non-null object
offerType              50000 non-null object
price                  50000 non-null object
abtest                 50000 non-null object
vehicleType            44905 non-null object
yearOfRegistration     50000 non-null int64
gearbox                47320 non-null object
powerPS                50000 non-null int64
model                  47242 non-null object
odometer               50000 non-null object
monthOfRegistration    50000 non-null int64
fuelType               45518 non-null object
brand                  50000 non-null object
notRepairedDamage      40171 non-null object
dateCreated            50000 non-null object
nrOfPictures           50000 non-null int64
postalCode             50000 non-null int64
lastSeen               50000 non-null object
dtypes: int64(5), object(15)
memory usage: 7.6+ MB

Index(['dateCrawled', 'name', 'seller', 'offerType', 'price', 'abtest',
       'vehicleType', 'yearOfRegistration', 'gearbox', 'powerPS', 'model',
       'odometer', 'monthOfRegistration', 'fuelType', 'brand',
       'notRepairedDamage', 'dateCreated', 'nrOfPictures', 'postalCode',
       'lastSeen'],
      dtype='object')

<h3> Changing the column names:</h3>
Some of the column names need to be modified, I created a function to do this and loop through the column names to change them.

In [96]:
autos.columns = ['date_crawled', 'name', 'seller', 'offer_type', 'price', 'ab_test',
       'vehicle_type', 'registration_year', 'gearbox', 'power_ps', 'model',
       'odometer', 'registration_month', 'fuel_type', 'brand',
       'unrepaired_damage', 'ad_created', 'num_photos', 'postal_code',
       'last_seen']

autos.head()
autos.head()

,date_crawled,name,seller,offer_type,price,ab_test,vehicle_type,registration_year,gearbox,power_ps,model,odometer,registration_month,fuel_type,brand,unrepaired_damage,ad_created,num_photos,postal_code,last_seen
0,2016-03-26 17:47:46,Peugeot_807_160_NAVTECH_ON_BOARD,privat,Angebot,"$5,000",control,bus,2004,manuell,158,andere,"150,000km",3,lpg,peugeot,nein,2016-03-26 00:00:00,0,79588,2016-04-06 06:45:54
1,2016-04-04 13:38:56,BMW_740i_4_4_Liter_HAMANN_UMBAU_Mega_Optik,privat,Angebot,"$8,500",control,limousine,1997,automatik,286,7er,"150,000km",6,benzin,bmw,nein,2016-04-04 00:00:00,0,71034,2016-04-06 14:45:08
2,2016-03-26 18:57:24,Volkswagen_Golf_1.6_United,privat,Angebot,"$8,990",test,limousine,2009,manuell,102,golf,"70,000km",7,benzin,volkswagen,nein,2016-03-26 00:00:00,0,35394,2016-04-06 20:15:37
3,2016-03-12 16:58:10,Smart_smart_fortwo_coupe_softouch/F1/Klima/Pan...,privat,Angebot,"$4,350",control,kleinwagen,2007,automatik,71,fortwo,"70,000km",6,benzin,smart,nein,2016-03-12 00:00:00,0,33729,2016-03-15 03:16:28
4,2016-04-01 14:38:50,Ford_Focus_1_6_Benzin_TÜV_neu_ist_sehr_gepfleg...,privat,Angebot,"$1,350",test,kombi,2003,manuell,0,focus,"150,000km",7,benzin,ford,nein,2016-04-01 00:00:00,0,39218,2016-04-01 14:38:50

I will look for text columns where almost all of the values are the same. I will also look for columns where numeric values are stored as text.  price and odometer_km has text stored with it's numeric value, so I will remove the text and convert it to a int.

In [97]:
autos.describe()

,registration_year,power_ps,registration_month,num_photos,postal_code
count,50000.000000,50000.000000,50000.000000,50000.0,50000.000000
mean,2005.073280,116.355920,5.723360,0.0,50813.627300
std,105.712813,209.216627,3.711984,0.0,25779.747957
min,1000.000000,0.000000,0.000000,0.0,1067.000000
25%,1999.000000,70.000000,3.000000,0.0,30451.000000
50%,2003.000000,105.000000,6.000000,0.0,49577.000000
75%,2008.000000,150.000000,9.000000,0.0,71540.000000
max,9999.000000,17700.000000,12.000000,0.0,99998.000000

The "odometer_km" and "price" columns are not being counted as numeric data.  I will clean these columns below to ensure they are being counted as numeric data.

In [98]:
autos["odometer"]= (autos["odometer"]
                        .str.replace("km", "")
                        .str.replace(",", "")
                        .astype(int)
                      )

autos["price"] = (autos["price"]
                          .str.replace("$","")
                          .str.replace(",","")
                          .astype(int)
                          )

The "seller", "offer_type", and "nofpictures" columns do not have useful data to analyze.  I will remove these columns.

In [99]:
autos = autos.drop(["num_photos", "seller", "offer_type"], axis=1)

<h3> Removing incorrect data</h3>

I will examine data in the odometer_km and price columns and will remove data that doesn't fit with the dataset.

In [100]:
autos["odometer"].describe()

count     50000.000000
mean     125732.700000
std       40042.211706
min        5000.000000
25%      125000.000000
50%      150000.000000
75%      150000.000000
max      150000.000000
Name: odometer, dtype: float64

In [101]:
autos["odometer"].value_counts()

150000    32424
125000     5170
100000     2169
90000      1757
80000      1436
70000      1230
60000      1164
50000      1027
5000        967
40000       819
30000       789
20000       784
10000       264
Name: odometer, dtype: int64

There look to be more high mileage vehicles than low mileage vehiles/

In [102]:
autos["price"].value_counts().sort_index(ascending=True).head(20)

0     1421
1      156
2        3
3        1
5        2
8        1
9        1
10       7
11       2
12       3
13       2
14       1
15       2
17       3
18       1
20       4
25       5
29       1
30       7
35       1
Name: price, dtype: int64

In [103]:
autos["price"].value_counts().sort_index(ascending=False).head(20)

99999999    1
27322222    1
12345678    3
11111111    2
10000000    1
3890000     1
1300000     1
1234566     1
999999      2
999990      1
350000      1
345000      1
299000      1
295000      1
265000      1
259000      1
250000      1
220000      1
198000      1
197000      1
Name: price, dtype: int64

There are very few data points above 350K, and they could be skewing the mean upward. I will remove these points and keep the distribution at the bottom.

In [104]:
autos = autos[autos["price"].between(1,351000)]

<h3> Working with dates in the dataset </h3>
The date_crawled, ad_created, and last_seen columns all have dates.  I will examine these dates to see their distributions.

In [105]:
autos['date_crawled']= autos['date_crawled'].str[:10]
autos['ad_created']= autos['ad_created'].str[:10]
autos['last_seen']= autos['last_seen'].str[:10]

In [106]:
autos['date_crawled'].sort_index().value_counts(normalize=True, dropna=False)

2016-04-03    0.038608
2016-03-20    0.037887
2016-03-21    0.037373
2016-03-12    0.036920
2016-03-14    0.036549
2016-04-04    0.036487
2016-03-07    0.036014
2016-04-02    0.035478
2016-03-28    0.034860
2016-03-19    0.034778
2016-03-15    0.034284
2016-03-29    0.034099
2016-04-01    0.033687
2016-03-30    0.033687
2016-03-08    0.033296
2016-03-09    0.033090
2016-03-22    0.032987
2016-03-11    0.032575
2016-03-23    0.032225
2016-03-26    0.032204
2016-03-10    0.032184
2016-03-31    0.031834
2016-03-17    0.031628
2016-03-25    0.031607
2016-03-27    0.031092
2016-03-16    0.029610
2016-03-24    0.029342
2016-03-05    0.025327
2016-03-13    0.015670
2016-03-06    0.014043
2016-04-05    0.013096
2016-03-18    0.012911
2016-04-06    0.003171
2016-04-07    0.001400
Name: date_crawled, dtype: float64

The site was mostly crawled in March of 2016

In [107]:
autos['ad_created'].sort_index().value_counts(normalize=True, dropna=False)

2016-04-03    0.038855
2016-03-20    0.037949
2016-03-21    0.037579
2016-04-04    0.036858
2016-03-12    0.036755
2016-03-14    0.035190
2016-04-02    0.035149
2016-03-28    0.034984
2016-03-07    0.034737
2016-03-29    0.034037
2016-03-15    0.034016
2016-03-19    0.033687
2016-04-01    0.033687
2016-03-30    0.033501
2016-03-08    0.033316
2016-03-09    0.033151
2016-03-11    0.032904
2016-03-22    0.032801
2016-03-26    0.032266
2016-03-23    0.032060
2016-03-10    0.031895
2016-03-31    0.031875
2016-03-25    0.031751
2016-03-17    0.031278
2016-03-27    0.030989
2016-03-16    0.030125
2016-03-24    0.029280
2016-03-05    0.022897
2016-03-13    0.017008
2016-03-06    0.015320
                ...
2016-01-10    0.000041
2016-02-24    0.000041
2016-02-26    0.000041
2016-02-05    0.000041
2016-02-02    0.000041
2016-02-12    0.000041
2016-02-18    0.000041
2016-02-14    0.000041
2016-02-20    0.000041
2016-02-17    0.000021
2015-11-10    0.000021
2016-01-03    0.000021
2016-02-09    0.000021
2016-02-16    0.000021
2015-12-05    0.000021
2016-02-07    0.000021
2016-01-22    0.000021
2016-02-01    0.000021
2016-02-22    0.000021
2016-01-29    0.000021
2015-09-09    0.000021
2016-02-11    0.000021
2016-01-14    0.000021
2016-02-08    0.000021
2016-01-07    0.000021
2015-06-11    0.000021
2015-12-30    0.000021
2016-01-13    0.000021
2015-08-10    0.000021
2016-01-16    0.000021
Name: ad_created, Length: 76, dtype: float64

There are no ad_created cells that have a large proportion of the data.  Many of the ads were created a month before the data was scraped.

In [108]:
autos['last_seen'].sort_index().value_counts(normalize=True, dropna=False)

2016-04-06    0.221806
2016-04-07    0.131947
2016-04-05    0.124761
2016-03-17    0.028086
2016-04-03    0.025203
2016-04-02    0.024915
2016-03-30    0.024771
2016-04-04    0.024483
2016-03-12    0.023783
2016-03-31    0.023783
2016-04-01    0.022794
2016-03-29    0.022341
2016-03-22    0.021373
2016-03-28    0.020859
2016-03-20    0.020653
2016-03-21    0.020632
2016-03-24    0.019767
2016-03-25    0.019211
2016-03-23    0.018532
2016-03-26    0.016802
2016-03-16    0.016452
2016-03-15    0.015876
2016-03-19    0.015834
2016-03-27    0.015649
2016-03-14    0.012602
2016-03-11    0.012375
2016-03-10    0.010666
2016-03-09    0.009595
2016-03-13    0.008895
2016-03-08    0.007413
2016-03-18    0.007351
2016-03-07    0.005395
2016-03-06    0.004324
2016-03-05    0.001071
Name: last_seen, dtype: float64

Most of the sites were seen in early April (4/6/2016 has about 30%).

In [109]:
autos["registration_year"].describe()

count    48565.000000
mean      2004.755421
std         88.643887
min       1000.000000
25%       1999.000000
50%       2004.000000
75%       2008.000000
max       9999.000000
Name: registration_year, dtype: float64

The min and max for the registration_year columns do not make sense.

<h3> Removing Incorrect Registration Year Data </h3>
I will look into how many values have a registration_year below 1920 and after 2017 and will remove these data points.

In [110]:
(~autos["registration_year"].between(1910,2017)).sum() / autos.shape[0]

0.010130752599608772

Only about 1% of the data is before 1910 and after 2017.  I will remove these points

In [111]:
autos = autos[autos["registration_year"].between(1910,2017)]
autos["registration_year"].value_counts(normalize=True).head(10)

2000    0.065650
2005    0.061074
1999    0.060263
2004    0.056227
2003    0.056144
2006    0.055541
2001    0.054833
2002    0.051713
1998    0.049154
2007    0.047365
Name: registration_year, dtype: float64

The data are distributed with about 5% per year between 1998 and 2007.

<h3> Exploring Auto Brand Data </h3>
I will explore the auto brand data to see which brands I may wish to aggregate by.

In [112]:
autos['brand'].value_counts(normalize=True).head(20)

volkswagen        0.212593
bmw               0.108814
opel              0.108377
mercedes_benz     0.095896
audi              0.086098
ford              0.069831
renault           0.047677
peugeot           0.029601
fiat              0.025836
seat              0.018618
skoda             0.016163
nissan            0.015310
mazda             0.015248
smart             0.014312
citroen           0.014104
toyota            0.012668
hyundai           0.009985
sonstige_autos    0.009631
volvo             0.009090
mini              0.008695
Name: brand, dtype: float64

There were several car brands that represented less than 5% of the data. To aggregate the data, I will only aggregate the top car companies by price.

In [113]:
brand_counts = autos["brand"].value_counts(normalize=True)
common_brands = brand_counts[brand_counts > .05].index
print(common_brands)

Index(['volkswagen', 'bmw', 'opel', 'mercedes_benz', 'audi', 'ford'], dtype='object')

In [114]:
brand_mean_prices = {}

for brand in common_brands:
    brand_only = autos[autos["brand"] == brand]
    mean_price = brand_only["price"].mean()
    brand_mean_prices[brand] = int(mean_price)

brand_mean_prices

{'audi': 9239,
 'bmw': 8284,
 'ford': 3732,
 'mercedes_benz': 8528,
 'opel': 2952,
 'volkswagen': 5351}

The top brands look to be German brands.  Audis are the more expensive vehicles on German ebay.

<h3> Exploring Milage </h3>
Now I will compare the mileage of the top brands to see if there is a correlation between mileage and price.

In [115]:
bmp_series = pd.Series(brand_mean_prices)
pd.DataFrame(bmp_series, columns=["mean_price"])

               mean_price
audi                 9239
bmw                  8284
ford                 3732
mercedes_benz        8528
opel                 2952
volkswagen           5351

In [116]:
brand_mean_mileage = {}

for brand in common_brands:
    brand_only = autos[autos["brand"] == brand]
    mean_mileage = brand_only["odometer"].mean()
    brand_mean_mileage[brand] = int(mean_mileage)

mean_mileage = pd.Series(brand_mean_mileage).sort_values(ascending=False)
mean_prices = pd.Series(brand_mean_prices).sort_values(ascending=False)

In [117]:
brand_info = pd.DataFrame(mean_mileage,columns=['mean_mileage'])
brand_info

               mean_mileage
bmw                  132666
mercedes_benz        130962
opel                 129415
audi                 129406
volkswagen           128928
ford                 124255

In [118]:
brand_info["mean_price"] = mean_prices
brand_info

               mean_mileage  mean_price
bmw                  132666        8284
mercedes_benz        130962        8528
opel                 129415        2952
audi                 129406        9239
volkswagen           128928        5351
ford                 124255        3732


The range of car mileages does not vary as much as the prices do by brand, instead all falling within 10% for the top brands. There is a slight trend to the more expensive vehicles having higher mileage, with the less expensive vehicles having lower mileage.